# MinimumSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrimarySizeCriterion..::..MinimumSize Property
PrimarySizeCriterion Class See Also
---
The minimum size of this criterion.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinimumSize { get; set; }
```

Visual Basic
---
```text
Public Property MinimumSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinimumSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace